src/cf/Catalogs/ор_СМНН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ор_СМНН</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДействующиеВеществаМНН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_МНН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаВыпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_ФормыВыпуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЕСКЛП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>41</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФармакоТерапевтическаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_ФТГ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖНВЛП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторЕСКЛП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АТХКлассификация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АТХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ор_КлассификаторАТХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ор_МНН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ор_МНН</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодРаздела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРасширенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЛатинское</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействующиеВещества</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействующееВещество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ор_ДВЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ор_ФТГ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ор_ФТГ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодРаздела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеАнглийское</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ор_ФормыВыпуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ор_ФормыВыпуска</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛекарственнаяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_ЛекарственныеФормы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ор_КлассификаторАТХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ор_КлассификаторАТХ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРаздела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ор_СМНН/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить(ПустаяСсылка().Метаданные().Реквизиты.НаименованиеПолное.Имя)
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СокрЛП(Данные.НаименованиеПолное);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает описание блокируемых реквизитов
//
// Возвращаемое значение:
//  Массив - имена блокируемых реквизитов
//   Элемент массива - Строка в формате:
//     ИмяРеквизита[;ИмяЭлементаФормы,...]
//      где
//       ИмяРеквизита     - имя реквизита объекта
//       ИмяЭлементаФормы - имя элемента формы, связанного с реквизитом
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("ДействующиеВеществаМНН");
	БлокируемыеРеквизиты.Добавить("ФормаВыпуска");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

// Функция - получает массив не редактируемых интерактивно реквизитов
// 
// Возвращаемое значение:
//  НеРедактируемыеРеквизиты - массив нередактируемых реквизитов
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив;
	НеРедактируемыеРеквизиты.Добавить("КодЕСКЛП");
	НеРедактируемыеРеквизиты.Добавить("УникальныйИдентификаторЕСКЛП");
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции
// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьЭлементКлассификатора(ПараметрыДанных) Экспорт
	
	РезультатВозврат = Новый Структура;
	РезультатВозврат.Вставить("ВсеЭлементы", Новый Соответствие);
	РезультатВозврат.Вставить("КоличествоНовыхЭлементов", 0);
	РезультатВозврат.Вставить("КоличествоОбновленныхЭлементов", 0);
	РезультатВозврат.Вставить("МассивНовыхЭлементов", Новый Массив);
	
	МассивНовыхЭлементов = Новый Массив;
	КоличествоОбновленныхЭлементов = 0;
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("ТаблицаЗначений"           , Новый ТаблицаЗначений);
	ПараметрыПолучения.Вставить("ПоискПоКодуЕСКЛП"          , Истина);
	ПараметрыПолучения.Вставить("Дерево"                    , Новый ДеревоЗначений);
	ПараметрыПолучения.Вставить("ОбновлятьСуществующие"     , Ложь);
	
	Если ПараметрыДанных <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПолучения, ПараметрыДанных);
	КонецЕсли;
	
	Если ПараметрыПолучения.ТаблицаЗначений.Количество() = 0 Тогда 
		Возврат РезультатВозврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Таблица.КодЕСКЛП КАК КодЕСКЛП
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.КодЕСКЛП КАК КодЕСКЛП,
	|	ЕСТЬNULL(Спр.Ссылка, ЗНАЧЕНИЕ(Справочник.ор_СМНН.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	Таб КАК Таб
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ор_СМНН КАК Спр
	|		ПО (&ПоискПоКодуЕСКЛП)
	|			И Таб.КодЕСКЛП = Спр.КодЕСКЛП");
	
	Запрос.УстановитьПараметр("Таблица"         , ПараметрыПолучения.ТаблицаЗначений);
	Запрос.УстановитьПараметр("ПоискПоКодуЕСКЛП", ПараметрыПолучения.ПоискПоКодуЕСКЛП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбновлятьСуществующие = ПараметрыПолучения.ОбновлятьСуществующие;
	
	СоответсвиеЭлементов = Новый Соответствие;
	НайденыВсеЭлементы = Истина;
	Пока Выборка.Следующий() Цикл
		СоответсвиеЭлементов.Вставить(Выборка.КодЕСКЛП, Выборка.Ссылка);
		Если Выборка.Ссылка.Пустая() Тогда
			НайденыВсеЭлементы = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// Если не обновляем существующие и нет новых элементов, то выходим.
	Если НайденыВсеЭлементы И НЕ ОбновлятьСуществующие Тогда 
		РезультатВозврат.ВсеЭлементы = СоответсвиеЭлементов;
		РезультатВозврат.КоличествоНовыхЭлементов = МассивНовыхЭлементов.Количество();
		РезультатВозврат.КоличествоОбновленныхЭлементов = КоличествоОбновленныхЭлементов;
		РезультатВозврат.МассивНовыхЭлементов = МассивНовыхЭлементов;
		Возврат РезультатВозврат;
	КонецЕсли;

	// Формирование структуры реквизитов справочника.
	СтруктураДанных = Новый Структура();
	
	// Реквизит для записи в ТЧ.
	СтруктураДанных.Вставить("АТХ");
	
	Для Каждого Реквизит Из Метаданные.Справочники.ор_СМНН.Реквизиты Цикл
		СтруктураДанных.Вставить(Реквизит.Имя);
		Если ПараметрыПолучения.ТаблицаЗначений.Колонки.Найти(Реквизит.Имя) = Неопределено Тогда
			ПараметрыПолучения.ТаблицаЗначений.Колонки.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	ИзменяемыеЭлементы = ОбщегоНазначения.СкопироватьРекурсивно(СоответсвиеЭлементов);
	Для Каждого ТекущийЭлемент Из ИзменяемыеЭлементы Цикл
		
		СправочникСсылка = ТекущийЭлемент.Значение;
		Если НЕ СправочникСсылка.Пустая()
			И НЕ ОбновлятьСуществующие Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("КодЕСКЛП", ТекущийЭлемент.Ключ);
		НайденныеСтроки = ПараметрыПолучения.Дерево.Строки.НайтиСтроки(СтруктураПоиска, Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураДанных, НайденныеСтроки[0]);
			
			// Заполняем стуктуру данных для справочника.
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
			|	МНН.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ор_МНН КАК МНН
			|ГДЕ
			|	МНН.Наименование = &Наименование");
			Запрос.УстановитьПараметр("Наименование", НайденныеСтроки[0].СтандартизированноеМНН);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				НовыйМНН = Справочники.ор_МНН.СоздатьЭлемент();
				НовыйМНН.Наименование = НайденныеСтроки[0].СтандартизированноеМНН;
				НовыйМНН.Записать();
				
				СтруктураДанных.ДействующиеВеществаМНН = НовыйМНН.Ссылка;
			Иначе
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					СтруктураДанных.ДействующиеВеществаМНН = ВыборкаДетальныеЗаписи.Ссылка;
				КонецЕсли;
			КонецЕсли;
			
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
			|	ФТГ.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ор_ФТГ КАК ФТГ
			|ГДЕ
			|	ФТГ.Наименование = &Наименование");
			Запрос.УстановитьПараметр("Наименование", НайденныеСтроки[0].НаименованиеФТГ);
			
			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				СтруктураДанных.ФармакоТерапевтическаяГруппа = ВыборкаДетальныеЗаписи.Ссылка;
			Иначе
				СтруктураДанных.ФармакоТерапевтическаяГруппа = Справочники.ор_ФТГ.ПустаяСсылка();
			КонецЕсли;
			
			СтруктураДанных.НаименованиеПолное = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1, %2",
				НайденныеСтроки[0].СтандартизированноеМНН,
				НайденныеСтроки[0].СтандартизированнаяЛекарственнаяФорма);
			СтруктураДанных.АТХ = НайденныеСтроки[0].КодАТХ;
			
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ФормыВыпуска.Ссылка КАК Ссылка,
			|	ФормыВыпуска.Количество КАК Количество,
			|	ЕСТЬNULL(ЕдиницыИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование
			|ИЗ
			|	Справочник.ор_ФормыВыпуска КАК ФормыВыпуска
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
			|		ПО ФормыВыпуска.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
			|ГДЕ
			|	ФормыВыпуска.ЛекарственнаяФорма.Наименование = &НаименованиеЛекФорма");
			Запрос.УстановитьПараметр("НаименованиеЛекФорма", НайденныеСтроки[0].СтандартизированнаяЛекарственнаяФорма);
			
			СтруктураДанных.ФормаВыпуска = Справочники.ор_ФормыВыпуска.ПустаяСсылка();
			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТекущееНаименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"%1 %2",
					ВыборкаДетальныеЗаписи.Количество,
					ВыборкаДетальныеЗаписи.ЕдиницаИзмеренияНаименование);
				Если ВыборкаДетальныеЗаписи.ЕдиницаИзмеренияНаименование = НайденныеСтроки[0].СтандартизированнаяЛекарственнаяДоза
					ИЛИ ТекущееНаименование = НайденныеСтроки[0].СтандартизированнаяЛекарственнаяДоза Тогда
					СтруктураДанных.ФормаВыпуска = ВыборкаДетальныеЗаписи.Ссылка;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			НайденныеСтроки = ПараметрыПолучения.ТаблицаЗначений.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(СтруктураДанных, НайденныеСтроки[0]);
			КонецЕсли;
		КонецЕсли;
		
		Если СправочникСсылка.Пустая() Тогда
			СсылкаСправочника = СоздатьЭлементСлужебный(
				СтруктураДанных,
				СправочникСсылка,
				ОбновлятьСуществующие);
			СоответсвиеЭлементов.Вставить(ТекущийЭлемент.Ключ, СсылкаСправочника);
			
			МассивНовыхЭлементов.Добавить(СсылкаСправочника);
		Иначе
			СоздатьЭлементСлужебный(СтруктураДанных, СправочникСсылка, ОбновлятьСуществующие);
			КоличествоОбновленныхЭлементов = КоличествоОбновленныхЭлементов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатВозврат.ВсеЭлементы = СоответсвиеЭлементов;
	РезультатВозврат.КоличествоНовыхЭлементов = МассивНовыхЭлементов.Количество();
	РезультатВозврат.КоличествоОбновленныхЭлементов = КоличествоОбновленныхЭлементов;
	РезультатВозврат.МассивНовыхЭлементов = МассивНовыхЭлементов;
	
	Возврат РезультатВозврат;
	
КонецФункции

Функция СоздатьЭлементСлужебный(Данные, СправочникСсылка, ОбновлятьСуществующие)
	
	Если СправочникСсылка.Пустая() Тогда
		СправочникОбъект = Справочники.ор_СМНН.СоздатьЭлемент();
	Иначе
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СправочникОбъект, Данные);
	
	СправочникОбъект.АТХКлассификация.Очистить();
	Если ЗначениеЗаполнено(Данные.АТХ) Тогда
		
		// Разбиваем строку со списком АТХ в массив.
		МассивАТХ = СтрРазделить(Данные.АТХ, ";", Ложь);
		Для Счетчик = 0 По МассивАТХ.Количество() - 1 Цикл
			МассивАТХ[Счетчик] = СокрЛП(МассивАТХ[Счетчик]);
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	АТХКлассификация.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ АТХСсылки
		|ИЗ
		|	Справочник.ор_КлассификаторАТХ КАК АТХКлассификация
		|ГДЕ
		|	АТХКлассификация.КодРаздела В(&МассивАТХ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СМННАТХКлассификация.АТХ КАК АТХ
		|ПОМЕСТИТЬ ТЧСМНН
		|ИЗ
		|	Справочник.ор_СМНН.АТХКлассификация КАК СМННАТХКлассификация
		|ГДЕ
		|	СМННАТХКлассификация.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АТХСсылки.Ссылка КАК Ссылка
		|ИЗ
		|	АТХСсылки КАК АТХСсылки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЧСМНН КАК ТЧСМНН
		|		ПО АТХСсылки.Ссылка = ТЧСМНН.АТХ
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ТЧСМНН.АТХ ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
		
		Запрос.УстановитьПараметр("МассивАТХ", МассивАТХ);
		Запрос.УстановитьПараметр("Ссылка", СправочникСсылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = СправочникОбъект.АТХКлассификация.Добавить();
			НоваяСтрока.АТХ = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
	КонецЕсли;
	
	Попытка
		СправочникОбъект.Записать();
		_Возврат = СправочникОбъект.Ссылка;
	Исключение
		_Возврат = Справочники.ор_СМНН.ПустаяСсылка();
	КонецПопытки;
	
	Возврат _Возврат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
